# Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.
encoding = 'utf-8'
a = int(input("введите трехзначное число:"))
a1 = a // 100
a2 = (a - (a1*100))//10
a3 = (a - (a1*100))%10

sum = a1+a2+a3
production = a1*a2*a3

print(a, sum,production)

