# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.


letter_number = int(input("введите порядковый номер буквы(от 1 до 33)"))
alphabet = ['А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н','О',
            'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я']
if letter_number > 0 & letter_number < 32:
    print(alphabet[letter_number-1])
else:
    print("введите число от 1 до 33")






